# Задайте два числа. Напишите программу, которая найдет НОК 
# (наименьшее общее кратное) этих двух чисел

num = 12
for i in num:
    print(num)
    num /= 2
    