# Задайте список из вещественных чисел. Напишите программу, которая найдёт 
# разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

listt = [1.1, 1.2, 3.1, 5, 10.01]
max = listt[0] - listt[0] // 1
min = listt[0] - listt[0] // 1
n = 0

for i in range(len(listt)):
    n = listt[i] - listt[i] // 1  
    if 0 < n > max:
        max = n
    elif 0 < n < min:
        min = n

print (round(max - min, 2))
